---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.OverlappingAdjacentFaces
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.OverlappingAdjacentFaces

Adjacent faces which either exactly overlaps or have a too
 acute angle between them. This issue can be reported for face
 sets with duplicate faces as well.
 Associated numbers are face and loop indices of one face and
 face and loop indices of another face respectively.